[{"abstract":"CB2 is a multi-agent platform to study collaborative natural language interaction in a grounded task-oriented scenario. It includes a 3D game environment, a backend server designed to serve trained models to human agents, and various tools and processes to enable scalable studies. We deploy CB2 at https://cb2.ai as a system demonstration with a learned instruction following model.","authors":["Jacob Sharf","Mustafa Omer Gul","Yoav Artzi"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-1_-generation-(demo)-(poster)"],"forum":"","id":"D103","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] CB2: Collaborative Natural Language Interaction Research Platform","tldr":"CB2 is a multi-agent platform to study collaborative natural language interaction in a grounded task-oriented scenario. It includes a 3D game environment, a backend server designed to serve trained models to human agents, and various tools and processes to enable scalable studies. We deploy CB2 at h...","track":"Generation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Past work in natural language processing interpretability focused mainly on popular classification tasks while largely overlooking generation settings, partly due to a lack of dedicated tools. In this work, we introduce Inseq, a Python library to democratize access to interpretability analyses of sequence generation models. Inseq enables intuitive and optimized extraction of models' internal information and feature importance scores for popular decoder-only and encoder-decoder Transformers architectures. We showcase its potential by adopting it to highlight gender biases in machine translation models and locate factual knowledge inside GPT-2. Thanks to its extensible interface supporting cutting-edge techniques such as contrastive feature attribution, Inseq can drive future advances in explainable natural language generation, centralizing good practices and enabling fair and reproducible model evaluations.","authors":["Gabriele Sarti","Nils Feldhus","Ludwig Sickert","Oskar van der Wal"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-5_-interpretability-and-analysis-of-models-for-nlp-(demo)-(poster)"],"forum":"","id":"D104","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Inseq: An Interpretability Toolkit for Sequence Generation Models","tldr":"Past work in natural language processing interpretability focused mainly on popular classification tasks while largely overlooking generation settings, partly due to a lack of dedicated tools. In this work, we introduce Inseq, a Python library to democratize access to interpretability analyses of se...","track":"Interpretability and Analysis of Models for NLP (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"We present a causal language analysis pipeline that leverages a Large Language Model to identify causal claims made in natural language documents, and aggregates claims across a corpus to produce a causal claim network. The pipeline then applies a clustering algorithm that groups causal claims based on their semantic topics. We demonstrate the pipeline by modeling causal belief systems surrounding the Covid-19 vaccine from tweets.","authors":["John Priniski","Ishaan Verma","Fred Morstatter"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-4_-nlp-applications-(demo)-(poster)"],"forum":"","id":"D105","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Pipeline for modeling causal beliefs from natural language","tldr":"We present a causal language analysis pipeline that leverages a Large Language Model to identify causal claims made in natural language documents, and aggregates claims across a corpus to produce a causal claim network. The pipeline then applies a clustering algorithm that groups causal claims based...","track":"NLP Applications (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Heterogenity of data-to-text generation datasets limits the research on data-to-text generation systems. We present TabGenie -- a toolkit which enables researchers to explore, preprocess, and analyze a variety of data-to-text generation datasets through the unified framework of table-to-text generation. In TabGenie, all inputs are represented as tables with associated metadata. The tables can be explored through a web interface, which also provides an interactive mode for debugging table-to-text generation, facilitates side-by-side comparison of generated system outputs, and allows easy exports for manual analysis. Furthermore, TabGenie is equipped with command line processing tools and Python bindings for unified dataset loading and processing. We release TabGenie as a PyPI package and provide its open-source code and a live demo at https://github.com/kasnerz/tabgenie.","authors":["Zdeněk Kasner","Ekaterina Garanina","Ondrej Platek","Ondrej Dusek"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-2_-information-extraction-(demo)-(poster)"],"forum":"","id":"D106","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] TabGenie: A Toolkit for Table-to-Text Generation","tldr":"Heterogenity of data-to-text generation datasets limits the research on data-to-text generation systems. We present TabGenie -- a toolkit which enables researchers to explore, preprocess, and analyze a variety of data-to-text generation datasets through the unified framework of table-to-text generat...","track":"Information Extraction (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Online conversation is a ubiquitous way to share information and connect everyone but repetitive idiomatic text typing takes users a lot of time.\nThis paper demonstrates a simple yet effective cloud based smart compose system to improve human-to-human conversation efficiency. \nHeuristics from different perspectives are designed to achieve the best trade-off between quality and latency.\nFrom the modeling side, the decoder-only model exploited the previous turns of conversational history in a computation lightweight manner. \nBesides, a novel phrase tokenizer is proposed to reduce latency without losing the composing quality further. \nAdditionally, the caching mechanism is applied to the serving framework. \nThe demo video of the system is available at https://youtu.be/U1KXkaqr60g.\nWe open-sourced our phrase tokenizer in https://github.com/tensorflow/text.","authors":["Yun Zhu","Xiayu Chen","Lei Shu","Bowen Tan","Xinying Song","Lijuan Liu","Maria Wang","Jindong Chen","Ning Ruan"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-2_-dialogue-and-interactive-systems-(demo)-(poster)"],"forum":"","id":"D107","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] An Efficient Conversational Smart Compose System","tldr":"Online conversation is a ubiquitous way to share information and connect everyone but repetitive idiomatic text typing takes users a lot of time.\nThis paper demonstrates a simple yet effective cloud based smart compose system to improve human-to-human conversation efficiency. \nHeuristics from differ...","track":"Dialogue and Interactive Systems (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"We present a human-in-the-loop dashboard tailored to diagnosing potential spurious features that NLI models rely on for predictions. \nThe dashboard enables users to generate diverse and challenging examples by drawing inspiration from GPT-3 suggestions. \nAdditionally, users can receive feedback from a trained NLI model on how challenging the newly created example is and make refinements based on the feedback.\nThrough our investigation, we discover several categories of spurious correlations that impact the reasoning of NLI models, which we group into three categories: Semantic Relevance, Logical Fallacies, and Bias. Based on our findings, we identify and describe various research opportunities, including diversifying training data and assessing NLI models' robustness by creating adversarial test suites.","authors":["Robin Chan","Afra Amini","Mennatallah El-Assady"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-5_-interpretability-and-analysis-of-models-for-nlp-(demo)-(poster)"],"forum":"","id":"D110","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Which Spurious Correlations Impact Reasoning in NLI Models? A Visual Interactive Diagnosis through Data-Constrained Counterfactuals","tldr":"We present a human-in-the-loop dashboard tailored to diagnosing potential spurious features that NLI models rely on for predictions. \nThe dashboard enables users to generate diverse and challenging examples by drawing inspiration from GPT-3 suggestions. \nAdditionally, users can receive feedback from...","track":"Interpretability and Analysis of Models for NLP (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"We demonstrate an interactive system to help operations research (OR) practitioners convert the mathematical formulation of optimization problems from TeX document format into the solver modeling language. In practice, a manual translation is cumbersome and time-consuming. Moreover, it requires an in-depth understanding of the problem description and a technical expertise to produce the modeling code. Thus, our proposed system TeX2Solver helps partially automate this conversion and help the users build optimization models more efficiently. In this paper, we describe its interface and the components of the hierarchical parsing system. A video demo walk-through is available online at http://bit.ly/3kuOm3x","authors":["Rindra Ramamonjison","Timothy Yu","Linzi Xing","Mahdi Mostajabdaveh","Xiaorui Li","Xiaojin Fu","Xiongwei Han","Yuanzhe Chen","Ren Li","Kun Mao","Yong Zhang"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-3_-nlp-applications-(demo)-(poster)"],"forum":"","id":"D113","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] LaTeX2Solver: a Hierarchical Semantic Parsing of LaTeX Document into Code for an Assistive Optimization Modeling Application","tldr":"We demonstrate an interactive system to help operations research (OR) practitioners convert the mathematical formulation of optimization problems from TeX document format into the solver modeling language. In practice, a manual translation is cumbersome and time-consuming. Moreover, it requires an i...","track":"NLP Applications (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Alfred is the first system for programmatic weak supervision (PWS) that creates training data for machine learning by prompting. In contrast to typical PWS systems where weak supervision sources are programs coded by experts, Alfred enables users to encode their subject matter expertise via natural language prompts for language and vision-language models. Alfred provides a simple Python interface for the key steps of this emerging paradigm, with a high-throughput backend for large-scale data labeling. Users can quickly create, evaluate, and refine their prompt-based weak supervision sources; map the results to weak labels; and resolve their disagreements with a label model. Alfred enables a seamless local development experience backed by models served from self-managed computing clusters. It automatically optimizes the execution of prompts with optimized batching mechanisms.  We find that this optimization improves query throughput by 2.9x versus a naive approach.  We present two example use cases demonstrating Alfred on YouTube comment spam detection and pet breeds classification. Alfred is open source, available at https://github.com/BatsResearch/alfred.","authors":["Peilin Yu","Stephen Bach"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-7_-machine-learning-for-nlp-(demo)-(poster)"],"forum":"","id":"D117","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Alfred: A System for Prompted Weak Supervision","tldr":"Alfred is the first system for programmatic weak supervision (PWS) that creates training data for machine learning by prompting. In contrast to typical PWS systems where weak supervision sources are programs coded by experts, Alfred enables users to encode their subject matter expertise via natural ...","track":"Machine Learning for NLP (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"In recent years, In-context Learning (ICL) has gained increasing attention\nand emerged as the new paradigm for large language model (LLM) evaluation. Unlike traditional fine-tuning methods, ICL instead adapts the pre-trained models to unseen tasks without any parameter updates.\nHowever, the implementation of ICL is sophisticated due to the diverse retrieval and inference methods involved, as well as the varying pre-processing requirements for different models, datasets, and tasks. A unified and flexible framework for ICL is urgently needed to ease the implementation of the aforementioned components.\nTo facilitate ICL research, we introduce OpenICL, an open-source toolkit for ICL and LLM evaluation. OpenICL \nis research-friendly with a highly flexible architecture that users can easily combine different components to suit their needs.\nIt also provides various state-of-the-art retrieval and inference methods to streamline the process of adapting ICL to cutting-edge research.\nThe effectiveness of OpenICL has been validated on a wide range of NLP tasks, including classification, QA, machine translation, and semantic parsing. As a side-product, we found OpenICL to be an efficient yet robust tool for LLMs evaluation. OpenICL is released at https://github.com/Shark-NLP/OpenICL.","authors":["Zhenyu Wu","Yaoxiang Wang","Jiacheng Ye","Zhiyong Wu","Jiangtao Feng","Jingjing Xu","Yu Qiao"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-1_-machine-learning-for-nlp-(demo)-(poster)"],"forum":"","id":"D118","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] OpenICL: An Open-Source Framework for In-context Learning","tldr":"In recent years, In-context Learning (ICL) has gained increasing attention\nand emerged as the new paradigm for large language model (LLM) evaluation. Unlike traditional fine-tuning methods, ICL instead adapts the pre-trained models to unseen tasks without any parameter updates.\nHowever, the implemen...","track":"Machine Learning for NLP (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Teachers often guide students to improve their essays by adding engaging modifiers to polish the sentences. In this work, we present the first study on automatic sentence polishing by adding modifiers. Since there is no available dataset for the new task, we first automatically construct a large number of parallel data by removing modifiers in the engaging sentences collected from public resources. Then we fine-tune LongLM to reconstruct the original sentences from the corrupted ones. Considering that much overlap between inputs and outputs may bias the model to completely copy the inputs, we split each source sentence into sub-sentences and only require the model to generate the modified sub-sentences. Furthermore, we design a retrieval augmentation algorithm to prompt the model to add suitable modifiers. Automatic and manual evaluation on the auto-constructed test set and real human texts show that our model can generate more engaging sentences with suitable modifiers than strong baselines while keeping fluency. We deploy the model at \\url{http://coai.cs.tsinghua.edu.cn/static/polishSent/}. A demo video is available at \\url{https://youtu.be/Y6gFHOgSv8Y}.","authors":["Zhexin Zhang","Jian Guan","Xin Cui","Yu Ran","Bo Liu","Minlie Huang"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-4_-generation-(demo)-(poster)"],"forum":"","id":"D119","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Self-Supervised Sentence Polishing by Adding Engaging Modifiers","tldr":"Teachers often guide students to improve their essays by adding engaging modifiers to polish the sentences. In this work, we present the first study on automatic sentence polishing by adding modifiers. Since there is no available dataset for the new task, we first automatically construct a large num...","track":"Generation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Writing assistants are valuable tools that can help writers improve their writing skills. We introduce Effidit (\\textbf{Eff}icient and \\textbf{I}ntelligent E\\textbf{dit}ing), a digital writing assistant that facilitates users to write higher-quality text more efficiently through the use of Artificial Intelligence (AI) and Natural Language Processing (NLP) technologies. We significantly expand the capacities of a writing assistant\nby providing functions in three modules: text completion, hint recommendation, and writing refinement. Based on the above efforts, Effidit can efficiently assist users in creating their own text. Effidit has been deployed to several Tencent products and publicly released at \\url{https://effidit.qq.com/}.","authors":["Shuming Shi","Enbo Zhao","Wei Bi","Deng Cai","Leyang Cui","Xinting Huang","Haiyun Jiang","Duyu Tang","Kaiqiang Song","Longyue Wang","Chenyan Huang","Guoping Huang","Yan Wang","Piji Li"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-3_-nlp-applications-(demo)-(poster)"],"forum":"","id":"D123","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Effidit: An Assistant for Improving Writing Efficiency","tldr":"Writing assistants are valuable tools that can help writers improve their writing skills. We introduce Effidit (\\textbf{Eff}icient and \\textbf{I}ntelligent E\\textbf{dit}ing), a digital writing assistant that facilitates users to write higher-quality text more efficiently through the use of Artificia...","track":"NLP Applications (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Machine learning models often learn latent embedding representations that capture the domain semantics of their training data. These embedding representations are valuable for interpreting trained models, building new models, and analyzing new datasets. However, interpreting and using embeddings can be challenging due to their opaqueness, high dimensionality, and the large size of modern datasets. To tackle these challenges, we present WizMap, an interactive visualization tool to help researchers and practitioners easily explore large embeddings. With a novel multi-resolution embedding summarization method and a familiar map-like interaction design, WizMap enables users to navigate and interpret embedding spaces with ease. Leveraging modern web technologies such as WebGL and Web Workers, WizMap scales to millions of embedding points directly in users' web browsers and computational notebooks without the need for dedicated backend servers. WizMap is open-source and available at the following public demo link: https://poloclub.github.io/wizmap.","authors":["Zijie J. Wang","Fred Hohman","Duen Horng Chau"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-4_-machine-learning-for-nlp-(demo)-(poster)"],"forum":"","id":"D130","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] WizMap: Scalable Interactive Visualization for Exploring Large Machine Learning Embeddings","tldr":"Machine learning models often learn latent embedding representations that capture the domain semantics of their training data. These embedding representations are valuable for interpreting trained models, building new models, and analyzing new datasets. However, interpreting and using embeddings can...","track":"Machine Learning for NLP (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Our research focuses on the most prevalent type of queries— simple questions —exemplified by questions like \"What is the capital of France?\". These questions reference an entity such as \"France\", which is directly connected (one hop) to the answer entity \"Paris\" in the underlying knowledge graph (KG). We propose a multilingual Knowledge Graph Question Answering (KGQA) technique that orders potential responses based on the distance between the question's text embeddings and the answer's graph embeddings. A system incorporating this novel method is also described in our work.\n\nThrough comprehensive experimentation using various English and multilingual datasets and two KGs — Freebase and Wikidata — we illustrate the comparative advantage of the proposed method across diverse KG embeddings and languages. This edge is apparent even against robust baseline systems, including seq2seq QA models, search-based solutions and intricate rule-based pipelines. Interestingly, our research underscores that even advanced AI systems like ChatGPT encounter difficulties when tasked with answering simple questions. This finding emphasizes the relevance and effectiveness of our approach, which consistently outperforms such systems. We are making the source code and trained models from our study publicly accessible to promote further advancements in multilingual KGQA.","authors":["Anton Razzhigaev","Mikhail Salnikov","Valentin Malykh","Pavel Braslavski","Alexander Panchenko"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-3_-question-answering-(demo)-(poster)"],"forum":"","id":"D132","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] A System for Answering Simple Questions in Multiple Languages","tldr":"Our research focuses on the most prevalent type of queries— simple questions —exemplified by questions like \"What is the capital of France?\". These questions reference an entity such as \"France\", which is directly connected (one hop) to the answer entity \"Paris\" in the underlying knowledge graph (KG...","track":"Question Answering (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"We present KWJA, a high-performance unified Japanese text analyzer based on foundation models.\nKWJA supports a wide range of tasks, including typo correction, word segmentation, word normalization, morphological analysis, named entity recognition, linguistic feature tagging, dependency parsing, PAS analysis, bridging reference resolution, coreference resolution, and discourse relation analysis, making it the most versatile among existing Japanese text analyzers.\nKWJA solves these tasks in a multi-task manner but still achieves competitive or better performance compared to existing analyzers specialized for each task.\nKWJA is publicly available under the MIT license at https://github.com/ku-nlp/kwja.","authors":["Nobuhiro Ueda","Kazumasa Omura","Takashi Kodama","Hirokazu Kiyomaru","Yugo Murawaki","Daisuke Kawahara","Sadao Kurohashi"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-2_-multilingualism-and-cross-lingual-nlp-(demo)-(poster)"],"forum":"","id":"D133","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] KWJA: A Unified Japanese Analyzer Based on Foundation Models","tldr":"We present KWJA, a high-performance unified Japanese text analyzer based on foundation models.\nKWJA supports a wide range of tasks, including typo correction, word segmentation, word normalization, morphological analysis, named entity recognition, linguistic feature tagging, dependency parsing, PAS ...","track":"Multilingualism and Cross-Lingual NLP (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"We present Disease Network Constructor (DNC), a system that extracts and visualizes a disease network, in which nodes are entities such as diseases, proteins, and genes, and edges represent regulation relation. We focused on the disease network derived through regulation events found in scientific articles on idiopathic pulmonary fibrosis (IPF). The front-end web-base user interface of DNC includes two-dimensional (2D) and 3D visualizations of the constructed disease network. The back-end system of DNC includes several natural language processing (NLP) techniques to process biomedical text including BERT-based tokenization on the basis of Bidirectional Encoder Representations from Transformers (BERT), flat and nested named entity recognition (NER), candidate generation and candidate ranking for entity linking (EL) or, relation extraction (RE), and event extraction (EE) tasks. We evaluated the end-to-end EL and end-to-end nested EE systems to determine the DNC's back-end\nimplementation performance. To the best of our knowledge, this is the first attempt that addresses neural NER, EL, RE, and EE tasks in an end-to-end manner that constructs a path-way visualization from events, which we name Disease Network Constructor. The demonstration video can be accessed from https://youtu.be/rFhWwAgcXE8. We release an online system for end users and the source code is available at https://github.com/aistairc/PRISM-APIs/.","authors":["Mohammad Golam Sohrab","Khoa Duong","Goran Topić","Masami Ikeda","Nozomi Nagano","Yayoi Natsume-Kitatani","Masakata Kuroda","Mari Itoh","Hiroya Takamura"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-3_-nlp-applications-(demo)-(poster)"],"forum":"","id":"D134","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Disease Network Constructor: a Pathway Extraction and Visualization","tldr":"We present Disease Network Constructor (DNC), a system that extracts and visualizes a disease network, in which nodes are entities such as diseases, proteins, and genes, and edges represent regulation relation. We focused on the disease network derived through regulation events found in scientific a...","track":"NLP Applications (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Scientific research is inherently shaped by its authors' perspectives, influenced by various factors\nsuch as their personality, community, or society. Junior researchers often face challenges in identifying the perspectives reflected in the existing literature and struggle to develop their own viewpoints. In response to this issue, we introduce PersLEARN , a tool designed to facilitate the cultivation of scientific perspectives, starting from a basic seed idea and progressing to a well-articulated framework. By interacting with a prompt-based model, researchers can develop their perspectives explicitly. Our human\nstudy reveals that scientific perspectives developed by students using PersLEARN exhibit a superior level of logical coherence and depth compared to those that did not. Furthermore, our pipeline outperforms baseline approaches across multiple domains of literature from various perspectives. These results suggest that PersLEARN could help foster a greater appreciation of diversity in scientific perspectives as an essential component of research training.","authors":["Yu-Zhe Shi","Shiqian Li","Xinyi Niu","Qiao Xu","Jiawen Liu","Yifan Xu","Shiyu Gu","Bingru He","Xinyang Li","Xinyu Zhao","Zijian Zhao","Yidong Lyu","Zhen Li","Sijia Liu","Lin Qiu","Jinhao Ji","Lecheng Ruan","Yuxi Ma","Wenjuan Han","Yixin Zhu"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-7_-linguistic-diversity-(demo)-(poster)"],"forum":"","id":"D14","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] PersLEARN: Research Training through the Lens of Perspective Cultivation","tldr":"Scientific research is inherently shaped by its authors' perspectives, influenced by various factors\nsuch as their personality, community, or society. Junior researchers often face challenges in identifying the perspectives reflected in the existing literature and struggle to develop their own viewp...","track":"Linguistic Diversity (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Many NLP tasks benefit from using large language models (LLMs) that often have more than 100 billion parameters. With the release of BLOOM-176B and OPT-175B, everyone can download pretrained models of this scale. Still, using these models requires high-end hardware unavailable to many researchers. In some cases, LLMs can be used more affordably via RAM offloading or hosted APIs. However, these techniques have innate limitations: offloading is too slow for interactive inference, while APIs are not flexible enough for research that requires access to weights, attention or logits. In this work, we propose Petals - a system for inference and fine-tuning of large models collaboratively by joining the resources of multiple parties. We demonstrate that this strategy outperforms offloading for very large models, running inference of BLOOM-176B on consumer GPUs with ≈1 step per second, which is enough for many interactive LLM applications. Unlike most inference APIs, Petals also natively exposes hidden states of served models, allowing to train and share custom model extensions based on efficient fine-tuning methods. The system, its source code, and documentation are available at https://petals.ml\n\nVideo (2 min): https://youtu.be/F4muLI-0hTE","authors":["Alexander Borzunov","Dmitry Baranchuk","Tim Dettmers","Maksim Riabinin","Younes Belkada","Artem Chumachenko","Pavel Samygin","Colin Raffel"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-6_-large-language-models-(demo)-(poster)"],"forum":"","id":"D141","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Petals: Collaborative Inference and Fine-tuning of Large Models","tldr":"Many NLP tasks benefit from using large language models (LLMs) that often have more than 100 billion parameters. With the release of BLOOM-176B and OPT-175B, everyone can download pretrained models of this scale. Still, using these models requires high-end hardware unavailable to many researchers. I...","track":"Large Language Models (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"The continuous development of Question Answering (QA) datasets has drawn the research community's attention toward multi-domain models. A popular approach is to use multi-dataset models, which are models trained on multiple datasets to learn their regularities and prevent overfitting to a single dataset. However, with the proliferation of QA models in online repositories such as GitHub or Hugging Face, an alternative is becoming viable. Recent works have demonstrated that combining expert agents can yield large performance gains over multi-dataset models. To ease research in multi-agent models, we extend UKP-SQuARE, an online platform for QA research, to support three families of multi-agent systems: i) agent selection, ii) early-fusion of agents, and iii) late-fusion of agents. We conduct experiments to evaluate their inference speed and discuss the performance vs. speed trade-off compared to multi-dataset models. UKP-SQuARE is open-source and publicly available.","authors":["Haritz Puerto","Tim Baumgärtner","Rachneet Sachdeva","Haishuo Fang","Hao Zhang","Sewin Tariverdian","Kexin Wang","Iryna Gurevych"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-6_-question-answering-(demo)-(poster)"],"forum":"","id":"D144","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] UKP-SQuARE v3: A Platform for Multi-Agent QA Research","tldr":"The continuous development of Question Answering (QA) datasets has drawn the research community's attention toward multi-domain models. A popular approach is to use multi-dataset models, which are models trained on multiple datasets to learn their regularities and prevent overfitting to a single dat...","track":"Question Answering (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"In this paper, we introduce Ranger - a toolkit to facilitate the easy use of effect-size-based meta-analysis for multi-task evaluation in NLP and IR. We observed that our communities often face the challenge of aggregating results over incomparable metrics and scenarios, which makes conclusions and take-away messages less reliable. With Ranger, we aim to address this issue by providing a task-agnostic toolkit that combines the effect of a treatment on multiple tasks into one statistical evaluation, allowing for comparison of metrics and computation of an overall summary effect. Our toolkit produces publication-ready forest plots that enable clear communication of evaluation results over multiple tasks. Our goal with the ready-to-use Ranger toolkit is to promote robust, effect-size-based evaluation and improve evaluation standards in the community. We provide two case studies for common IR and NLP settings to highlight Ranger's benefits.","authors":["Mete Sertkan","Sophia Althammer","Sebastian Hofstätter"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-7_-machine-learning-for-nlp-(demo)-(poster)"],"forum":"","id":"D147","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Ranger: A Toolkit for Effect-Size Based Multi-Task Evaluation","tldr":"In this paper, we introduce Ranger - a toolkit to facilitate the easy use of effect-size-based meta-analysis for multi-task evaluation in NLP and IR. We observed that our communities often face the challenge of aggregating results over incomparable metrics and scenarios, which makes conclusions and ...","track":"Machine Learning for NLP (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Noticing the urgent need to provide tools for fast and user-friendly qualitative analysis of large-scale textual corpora of the modern NLP, we propose to turn to the mature and well-tested methods from the domain of Information Retrieval (IR) - a research field with a long history of tackling TB-scale document collections. We discuss how Pyserini - a widely used toolkit for reproducible IR research can be integrated with the Hugging Face ecosystem of open-source AI libraries and artifacts. We leverage the existing functionalities of both platforms while proposing novel features further facilitating their integration. Our goal is to give NLP researchers tools that will allow them to develop retrieval-based instrumentation for their data analytics needs with ease and agility.\nWe include a Jupyter Notebook-based walk through the core interoperability features, available on GitHub: https://github.com/huggingface/gaia.\nWe then demonstrate how the ideas we present can be operationalized to create a powerful tool for qualitative data analysis in NLP. We present GAIA Search - a search engine built following previously laid out principles, giving access to four popular large-scale text collections. GAIA serves a dual purpose of illustrating the potential of methodologies we discuss but also as a standalone qualitative analysis tool that can be leveraged by NLP researchers aiming to understand datasets prior to using them in training. GAIA is hosted live on Hugging Face Spaces: https://huggingface.co/spaces/spacerini/gaia.","authors":["Aleksandra Piktus","Odunayo Ogundepo","Christopher Akiki","Akintunde Oladipo","Xinyu Zhang","Hailey Schoelkopf","Stella Biderman","Martin Potthast","Jimmy Lin"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-3_-resources-and-evaluation-(demo)-(poster)"],"forum":"","id":"D148","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] GAIA Search: Hugging Face and Pyserini Interoperability for NLP Training Data Exploration","tldr":"Noticing the urgent need to provide tools for fast and user-friendly qualitative analysis of large-scale textual corpora of the modern NLP, we propose to turn to the mature and well-tested methods from the domain of Information Retrieval (IR) - a research field with a long history of tackling TB-sca...","track":"Resources and Evaluation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"An open-source DeepPavlov Dream Platform is specifically tailored for development of complex dialog systems like Generative AI Assistants. The stack prioritizes efficiency, modularity, scalability, and extensibility with the goal to make it easier to develop complex dialog systems from scratch. It supports modular approach to implementation of conversational agents enabling their development through the choice of NLP components and conversational skills from a rich library organized into the distributions of ready-for-use multi-skill AI assistant systems. In DeepPavlov Dream, multi-skill Generative AI Assistant consists of NLP components that extract features from user utterances, conversational skills that generate or retrieve a response, skill and response selectors that facilitate choice of relevant skills and the best response, as well as a conversational orchestrator that enables creation of multi-skill Generative AI Assistants scalable up to industrial grade AI assistants. The platform allows to integrate large language models into dialog pipeline, customize with prompt engineering,  handle multiple prompts during the same dialog session and create simple multimodal assistants.","authors":["Diliara Zharikova","Daniel Kornev","Fedor Ignatov","Maxim Talimanchuk","Dmitry Evseev","Ksenya Petukhova","Veronika Smilga","Dmitry Karpov","Yana Shishkina","Dmitry Kosenko","Mikhail Burtsev"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-2_-generation-(demo)-(poster)"],"forum":"","id":"D156","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] DeepPavlov Dream: Platform for Building Generative AI Assistants","tldr":"An open-source DeepPavlov Dream Platform is specifically tailored for development of complex dialog systems like Generative AI Assistants. The stack prioritizes efficiency, modularity, scalability, and extensibility with the goal to make it easier to develop complex dialog systems from scratch. It s...","track":"Generation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"We introduce LAVIS, an open-source deep learning library for LAnguage-VISion research and applications. LAVIS aims to serve as a one-stop comprehensive library that brings recent advancements in the language-vision field accessible for researchers and practitioners, as well as fertilizing future research and development. It features a unified interface to easily access state-of-the-art image-language, video-language models and common datasets. LAVIS supports training, evaluation and benchmarking on a rich variety of tasks, including multimodal classification, retrieval, captioning, visual question answering, dialogue and pre-training. In the meantime, the library is also highly extensible and configurable, facilitating future development and customization. In this technical report, we describe design principles, key components and functionalities of the library, and also present benchmarking results across common language-vision tasks.","authors":["Dongxu Li","Junnan Li","Hung Le","Guangsen Wang","silvio savarese","Steven C.H. Hoi"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-1_-language-grounding-to-vision,-robotics-and-beyond-(demo)-(poster)"],"forum":"","id":"D17","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] LAVIS: A One-stop Library for Language-Vision Intelligence","tldr":"We introduce LAVIS, an open-source deep learning library for LAnguage-VISion research and applications. LAVIS aims to serve as a one-stop comprehensive library that brings recent advancements in the language-vision field accessible for researchers and practitioners, as well as fertilizing future res...","track":"Language Grounding to Vision, Robotics and Beyond (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Pre-trained transformer-based language models are becoming increasingly popular due to their exceptional performance on various benchmarks. However, concerns persist regarding the presence of hidden biases within these models, which can lead to discriminatory outcomes and reinforce harmful stereotypes. To address this issue, we propose Finspector, a human-centered visual inspection tool designed to detect biases in different categories through log-likelihood scores generated by language models. The goal of the tool is to enable researchers to easily identify potential biases using visual analytics, ultimately contributing to a fairer and more just deployment of these models in both academic and industrial settings. Finspector is available at https://github.com/IBM/finspector.","authors":["Bum Chul Kwon","Nandana Mihindukulasooriya"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-7_-large-language-models-(demo)-(poster)"],"forum":"","id":"D18","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Finspector: A Human-Centered Visual Inspection Tool for Exploring and Comparing Biases among Foundation Models","tldr":"Pre-trained transformer-based language models are becoming increasingly popular due to their exceptional performance on various benchmarks. However, concerns persist regarding the presence of hidden biases within these models, which can lead to discriminatory outcomes and reinforce harmful stereotyp...","track":"Large Language Models (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"The field of Question Answering (QA) has made remarkable progress in recent years, thanks to the advent of large pre-trained language models, newer realistic benchmark datasets with leaderboards, and novel algorithms for key components such as retrievers and readers. In this paper, we introduce PrimeQA: a one-stop and open-source QA repository with an aim to democratize QA research and facilitate easy replication of state-of-the-art (SOTA) QA methods. PrimeQA supports core QA functionalities like retrieval and reading comprehension as well as auxiliary capabilities such as question generation. It has been designed as an end-to-end toolkit for various use cases: building front-end applications, replicating SOTA methods on public benchmarks, and expanding pre-existing methods. PrimeQA is available at: https://github.com/primeqa.","authors":["Avi Sil","Jaydeep Sen","Bhavani Iyer","Martin Franz","Kshitij Fadnis","Mihaela Bornea","Sara Rosenthal","Scott McCarley","Rong Zhang","Vishwajeet Kumar","Yulong Li","Md Arafat Sultan","Riyaz Bhat","Juergen Bross","Radu Florian","Salim Roukos"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-6_-question-answering-(demo)-(poster)"],"forum":"","id":"D19","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] PrimeQA: The Prime Repository for State-of-the-Art Multilingual Question Answering Research and Development","tldr":"The field of Question Answering (QA) has made remarkable progress in recent years, thanks to the advent of large pre-trained language models, newer realistic benchmark datasets with leaderboards, and novel algorithms for key components such as retrievers and readers. In this paper, we introduce Prim...","track":"Question Answering (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Chinese modern poetry generation has been a challenging task. One issue is the Chinese word segmentation (CWS) which is critical to comprehend the Chinese language but was not always considered in common tokenization methods. Another is the decoding (sampling) method which may induce repetition and boredom and severely lower the diversity of the generated poetry. To address these issues, we present Lingxi, a diversity-aware Chinese modern poetry generation system. For the CWS issue, we propose a novel framework that incorporates CWS in the tokenization process. The proposed method can achieve a high vocabulary coverage rate with a reasonable vocabulary size. For the decoding method and the diversity issue, we propose a novel sampling algorithm that flattens the high likelihood part of the predicted distribution of the language model to emphasize the comparatively low-likelihood words and increase the diversity of generated poetry. Empirical results show that even when the top 60% of cumulative probability mass of the predicted distribution is flattened, our method achieves comparable or even better performance than baseline sampling methods. Our system is available at http://lingxi.website.","authors":["Xinran Zhang","Maosong Sun","Jiafeng Liu","Xiaobing Li"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-3_-linguistic-diversity-(demo)-(poster)"],"forum":"","id":"D24","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Lingxi: A Diversity-aware Chinese Modern Poetry Generation System","tldr":"Chinese modern poetry generation has been a challenging task. One issue is the Chinese word segmentation (CWS) which is critical to comprehend the Chinese language but was not always considered in common tokenization methods. Another is the decoding (sampling) method which may induce repetition and ...","track":"Linguistic Diversity (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Scientific literature is always available in Adobe's Portable Document Format (PDF), which is friendly for scientists to read. Compared with raw text, annotating directly on PDF documents can greatly improve the labeling efficiency of scientists whose annotation costs are very high. In this paper, we present Autodive, an integrated onsite scientific literature annotation tool for natural scientists and Natural Language Processing (NLP) researchers. This tool provides six core functions of annotation that support the whole lifecycle of corpus generation including i)annotation project management, ii)resource management, iii)ontology management, iv)manual annotation, v)onsite auto annotation, and vi)annotation task statistic. Two experiments are carried out to verify efficiency of the presented tool. A live demo of Autodive is available at http://autodive.sciwiki.cn. The source code is available at https://github.com/Autodive.","authors":["Yi Du","Ludi Wang","Mengyi Huang","Dongze Song","Wenjuan Cui","Yuanchun Zhou"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-1_-nlp-applications-(demo)-(poster)"],"forum":"","id":"D25","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Autodive: An Integrated Onsite Scientific Literature Annotation Tool","tldr":"Scientific literature is always available in Adobe's Portable Document Format (PDF), which is friendly for scientists to read. Compared with raw text, annotating directly on PDF documents can greatly improve the labeling efficiency of scientists whose annotation costs are very high. In this paper, w...","track":"NLP Applications (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Generating questions along with associated answers from a text has applications in several domains, such as creating reading comprehension tests for students, or improving document search by providing auxiliary questions and answers based on the query. Training models for question and answer generation (QAG) is not straightforward due to the expected structured output (i.e.\\ a list of question and answer pairs), as it requires more than generating a single sentence. This results in a small number of publicly accessible QAG models. In this paper, we introduce AutoQG, an online service for multilingual QAG along with \\texttt{lmqg}, an all-in-one python package for model fine-tuning, generation, and evaluation. We also release QAG models in eight languages fine-tuned on a few variants of pre-trained encoder-decoder language models, which can be used online via AutoQG or locally via \\texttt{lmqg}. With these resources, practitioners of any level can benefit from a toolkit that includes a web interface for end users, and easy-to-use code for developers who require custom models or fine-grained controls for generation.","authors":["Asahi Ushio","Fernando Alva-Manchego","Jose Camacho-Collados"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-6_-question-answering-(demo)-(poster)"],"forum":"","id":"D26","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] A Practical Toolkit for Multilingual Question and Answer Generation","tldr":"Generating questions along with associated answers from a text has applications in several domains, such as creating reading comprehension tests for students, or improving document search by providing auxiliary questions and answers based on the query. Training models for question and answer generat...","track":"Question Answering (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Spoken Language Understanding (SLU) is one of the core components of a task-oriented dialogue system, which aims to extract the semantic meaning of user queries (e.g., intents and slots). In this work, we introduce OpenSLU, an open-source toolkit to provide a unified, modularized, and extensible toolkit for spoken language understanding. Specifically, OpenSLU unifies 10 SLU models for both single-intent and multi-intent scenarios, which support both non-pretrained and pretrained models simultaneously. Additionally, OpenSLU is highly modularized and extensible by decomposing the model architecture, inference, and learning process into reusable modules, which allows researchers to quickly set up SLU experiments with highly flexible configurations. OpenSLU is implemented based on PyTorch, and released at https://github.com/LightChen233/OpenSLU.","authors":["Libo Qin","Qiguang Chen","Xiao Xu","Yunlong Feng","Wanxiang Che"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-3_-speech-and-multimodality-(demo)-(poster)"],"forum":"","id":"D27","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] OpenSLU: A Unified, Modularized, and Extensible Toolkit for Spoken Language Understanding","tldr":"Spoken Language Understanding (SLU) is one of the core components of a task-oriented dialogue system, which aims to extract the semantic meaning of user queries (e.g., intents and slots). In this work, we introduce OpenSLU, an open-source toolkit to provide a unified, modularized, and extensible too...","track":"Speech and Multimodality (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"We present  a  neural  Sanskrit  Natural Language Processing (NLP)  toolkit named SanskritShala (a school of Sanskrit) to facilitate computational linguistic analyses for several tasks such as word segmentation, morphological tagging, dependency parsing, and compound type identification. Our systems currently report state-of-the-art performance on available benchmark datasets for all tasks. SanskritShala is deployed as a web-based application, which allows a user to get real-time analysis for the given input. It is built with easy-to-use interactive data annotation features that allow annotators to correct the system predictions when it makes mistakes. We publicly release the source codes of the 4 modules included in the toolkit, 7 word embedding models that have been trained on publicly available Sanskrit corpora and multiple annotated datasets such as word similarity, relatedness, categorization, analogy prediction to assess intrinsic properties of word embeddings.  So far as we know, this is the first neural-based Sanskrit NLP toolkit that has a web-based interface and a number of NLP modules. We are sure that the people who are willing to work with Sanskrit will find it useful for pedagogical and annotative purposes. SanskritShala is available at: https://cnerg.iitkgp.ac.in/sanskritshala. The demo video of our platform can be accessed at: https://youtu.be/x0X31Y9k0mw4.","authors":["Jivnesh Sandhan","Anshul Agarwal","Laxmidhar Behera","Tushar Sandhan","Pawan Goyal"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-7_-linguistic-diversity-(demo)-(poster)"],"forum":"","id":"D30","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] SanskritShala: A Neural Sanskrit NLP Toolkit with Web-Based Interface for Pedagogical and Annotation Purposes","tldr":"We present  a  neural  Sanskrit  Natural Language Processing (NLP)  toolkit named SanskritShala (a school of Sanskrit) to facilitate computational linguistic analyses for several tasks such as word segmentation, morphological tagging, dependency parsing, and compound type identification. Our systems...","track":"Linguistic Diversity (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Systems that support users in the automatic creation of visualizations must address several subtasks - understand the semantics of data, enumerate relevant visualization goals and generate visualization specifications. In this work, we pose visualization generation as a multi-stage generation problem and argue that well-orchestrated pipelines based on large language models (LLMs) and image generation models (IGMs) are suitable to addressing these tasks. We present LIDA, a novel tool for generating grammar-agnostic visualizations and infographics. LIDA comprises of 4 modules - A SUMMARIZER that converts data into a rich but compact natural language summary, a GOAL EXPLORER that enumerates visualization goals given the data, a VISGENERATOR that generates, refines, executes and filters visualization code and an INFOGRAPHER module that yields data-faithful stylized graphics using IGMs. LIDA provides a python api, and a hybrid user interface (direct manipulation and multilingual natural language) for interactive chart, infographics and data story generation. \nCode and demo are available at this url - https://microsoft.github.io/lida/","authors":["Victor Dibia"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-6_-generation-(demo)-(poster)"],"forum":"","id":"D31","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] LIDA: A Tool for Automatic Generation of Grammar-Agnostic Visualizations and Infographics using Large Language Models","tldr":"Systems that support users in the automatic creation of visualizations must address several subtasks - understand the semantics of data, enumerate relevant visualization goals and generate visualization specifications. In this work, we pose visualization generation as a multi-stage generation proble...","track":"Generation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Metaphoric expressions are a special linguistic phenomenon, frequently appearing in everyday language. Metaphors do not take their literal meanings in contexts, which may cause obstacles for language learners to understand them. Metaphoric expressions also reflect the cognition of humans via concept mappings, attracting great attention from cognitive science and psychology communities. Thus, we aim to develop a computational metaphor processing online system, termed MetaPro Online, that allows users without a coding background, e.g., language learners and linguists, to easily query metaphoricity labels, metaphor paraphrases, and concept mappings for non-domain-specific text. The outputs of MetaPro can be directly used by language learners and natural language processing downstream tasks because MetaPro is an end-to-end system.","authors":["Rui Mao","Xiao Li","Kai He","Mengshi Ge","Erik Cambria"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-4_-generation-(demo)-(virtual-poster)"],"forum":"","id":"D32","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] MetaPro Online: A Computational Metaphor Processing Online System","tldr":"Metaphoric expressions are a special linguistic phenomenon, frequently appearing in everyday language. Metaphors do not take their literal meanings in contexts, which may cause obstacles for language learners to understand them. Metaphoric expressions also reflect the cognition of humans via concept...","track":"Generation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"In this work, we present DIAGRAPH, an open-source graphical dialog flow editor built on the ADVISER toolkit. \nOur goal for this tool is threefold: \n1) To support subject-experts to intuitively create complex and flexible dialog systems,\n2) To support rapid prototyping of dialog system behavior, e.g., for research, and \n3) To provide a hands-on test bed for students learning about dialog systems.\nTo facilitate this, DIAGRAPH aims to provide a clean and intuitive graphical interface for creating dialog systems without requiring any coding knowledge.\nOnce a dialog graph has been created, it is automatically turned into a dialog system using state of the art language models. This allows for rapid prototyping and testing.\nDialog designers can then distribute a link to their finished  dialog system or embed it into a website.\nAdditionally, to support scientific experiments and data collection, dialog designers can access chat logs. \nFinally, to verify the usability of DIAGRAPH, we performed evaluation with subject-experts who extensively worked with the tool and users testing it for the first time, receiving above average System Usability Scale (SUS) scores from both (82 out 100 and 75 out of 100, respectively).\nIn this way, we hope DIAGRAPH helps reduce the barrier to entry for creating dialog interactions.","authors":["Dirk Väth","Lindsey Vanderlyn","Ngoc Thang Vu"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-3_-dialogue-and-interactive-systems-(demo)-(poster)"],"forum":"","id":"D39","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] DIAGRAPH: An Open-Source Graphic Interface for Dialog Flow Design","tldr":"In this work, we present DIAGRAPH, an open-source graphical dialog flow editor built on the ADVISER toolkit. \nOur goal for this tool is threefold: \n1) To support subject-experts to intuitively create complex and flexible dialog systems,\n2) To support rapid prototyping of dialog system behavior, e.g....","track":"Dialogue and Interactive Systems (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Pre-trained language models and other generative models have revolutionized NLP and beyond. However, these models tend to reproduce undesirable biases present in their training data. Also, they may overlook patterns that are important but challenging to capture. To address these limitations, researchers have introduced distributional control techniques. These techniques, not limited to language, allow controlling the prevalence (i.e. expectations) of any features of interest in the model's outputs. Despite their potential, the widespread adoption of these techniques has been hindered by the difficulty in adapting the complex, disconnected code. Here, we present disco, an open-source Python library that brings these techniques to the broader public","authors":["Germán Kruszewski","Jos Rozen","Marc Dymetman"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-1_-generation-(demo)-(poster)"],"forum":"","id":"D44","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Disco: a toolkit for Distributional Control of Generative Models","tldr":"Pre-trained language models and other generative models have revolutionized NLP and beyond. However, these models tend to reproduce undesirable biases present in their training data. Also, they may overlook patterns that are important but challenging to capture. To address these limitations, researc...","track":"Generation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Hyperparameter optimization is an important but often overlooked process in the research of deep learning technologies. To obtain a good model, one must carefully tune hyperparameters that determine the architecture and training algorithm. Insufficient tuning may result in poor results, while inequitable tuning may lead to exaggerated differences between models. We present a hyperparameter optimization toolkit for neural machine translation (NMT) to help researchers focus their time on the creative rather than the mundane. The toolkit is implemented as a wrapper on top of the open-source Sockeye NMT software. Using the Asynchronous Successive Halving Algorithm (ASHA), we demonstrate that it is possible to discover near-optimal models under a computational budget with little effort.\n\nCode: https://github.com/kevinduh/sockeye-recipes3\n\nVideo demo: https://cs.jhu.edu/~kevinduh/j/demo.mp4","authors":["Xuan Zhang","Kevin Duh","Paul McNamee"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-4_-machine-translation-(demo)-(poster)"],"forum":"","id":"D45","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] A Hyperparameter Optimization Toolkit for Neural Machine Translation Research","tldr":"Hyperparameter optimization is an important but often overlooked process in the research of deep learning technologies. To obtain a good model, one must carefully tune hyperparameters that determine the architecture and training algorithm. Insufficient tuning may result in poor results, while inequi...","track":"Machine Translation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Live video streaming has become an important form of communication such as virtual conferences. However, for cross-language communication in live video streaming, reading subtitles degrades the viewing experience. To address this problem, our simultaneous dubbing prototype translates and replaces the original speech of a live video stream in a simultaneous manner. Tests on a collection of 90 public videos show that our system achieves a low average latency of 11.90 seconds for smooth playback. Our method is general and can be extended to other language pairs.","authors":["Xiaolin Wang","Masao Utiyama","Eiichiro Sumita"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-4_-machine-translation-(demo)-(poster)"],"forum":"","id":"D46","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Japanese-to-English Simultaneous Dubbing Prototype","tldr":"Live video streaming has become an important form of communication such as virtual conferences. However, for cross-language communication in live video streaming, reading subtitles degrades the viewing experience. To address this problem, our simultaneous dubbing prototype translates and replaces th...","track":"Machine Translation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"We present Visual Knowledge oriented Programming platform (<b>VisKoP</b>), a knowledge base question answering (KBQA) system that integrates human into the loop to edit and debug the knowledge base (KB) queries. VisKoP not only provides a neural program induction module, which converts natural language questions into knowledge oriented program language (KoPL), but also maps KoPL programs into graphical elements. KoPL programs can be edited with simple graphical operators, such as <i>''dragging''</i> to add knowledge operators and <i>''slot filling''</i> to designate operator arguments. Moreover, VisKoP provides auto-completion for its knowledge base schema and users can easily debug the KoPL program by checking its intermediate results. To facilitate the practical KBQA on a million-entity-level KB, we design a highly efficient KoPL execution engine for the back-end. Experiment results show that VisKoP is highly efficient and user interaction can fix a large portion of wrong KoPL programs to acquire the correct answer. The VisKoP online demo, highly efficient KoPL engine, and screencast video are now publicly available.","authors":["Zijun Yao","YUANYONG CHEN","Xin Lv","Shulin Cao","Amy Xin","Jifan Yu","Hailong Jin","jianjun xu","Peng Zhang","Lei Hou","Juanzi Li"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-5_-question-answering-(demo)-(poster)"],"forum":"","id":"D47","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] VisKoP: Visual Knowledge oriented Programming for Interactive Knowledge Base Question Answering","tldr":"We present Visual Knowledge oriented Programming platform (<b>VisKoP</b>), a knowledge base question answering (KBQA) system that integrates human into the loop to edit and debug the knowledge base (KB) queries. VisKoP not only provides a neural program induction module, which converts natural langu...","track":"Question Answering (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"English is acknowledged worldwide as a mode of communication. However, due to the absence of realistic practicing scenarios, students learning English as a foreign language (EFL) typically have limited chances to converse and share feedback with others. In this paper, we propose PEEP-Talk, a real-world situational dialogue-based chatbot designed for English education. It also naturally switches to a new topic or situation in response to out-of-topic utterances, which are common among English beginners. Furthermore, PEEP-Talk provides feedback score on conversation and grammar error correction. We performed automatic and user evaluations to validate performance and education efficiency of our system. The results show that PEEP-Talk generates appropriate responses in various real-life situations while providing accurate feedback to learners. Moreover, we demonstrate a positive impact on English-speaking, grammar, and English learning anxiety, implying that PEEP-Talk can lower the barrier to learning natural conversation in effective ways.","authors":["Seugnjun Lee","Yoonna Jang","Chanjun Park","Jungseob Lee","Jaehyung Seo","Hyeonseok Moon","Sugyeong Eo","Seounghoon Lee","Bernardo Yahya","Heuiseok Lim"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-7_-dialogue-and-interactive-systems-(demo)-(poster)"],"forum":"","id":"D49","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] PEEP-Talk: A Situational Dialogue-based Chatbot for English Education","tldr":"English is acknowledged worldwide as a mode of communication. However, due to the absence of realistic practicing scenarios, students learning English as a foreign language (EFL) typically have limited chances to converse and share feedback with others. In this paper, we propose PEEP-Talk, a real-wo...","track":"Dialogue and Interactive Systems (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Despite the latest improvements on machine translation, professional translators still must review and post-edit the automatic output to ensure high-quality translations. The research on automating this process lacks an interactive post-editing environment implemented for this purpose; therefore, current approaches do not consider the human interactions that occur in real post-editing scenarios. To address this issue, we present OpenTIPE, a flexible and extensible framework that aims at supporting research on interactive post-editing. Specifically, the interactive environment of OpenTIPE allows researchers to explore human-centered approaches for the post-editing task. We release the OpenTIPE source code and showcase its main functionalities with a demonstration video and an online live demo.","authors":["Fabian Landwehr","Thomas Steinmann","Laura Mascarell"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-4_-machine-translation-(demo)-(poster)"],"forum":"","id":"D53","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] OpenTIPE: An Open-source Translation Framework for Interactive Post-Editing Research","tldr":"Despite the latest improvements on machine translation, professional translators still must review and post-edit the automatic output to ensure high-quality translations. The research on automating this process lacks an interactive post-editing environment implemented for this purpose; therefore, cu...","track":"Machine Translation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Recently, the success of pre-training in text domain has been fully extended to vision, audio, and cross-modal scenarios. The proposed pre-training models of different modalities are showing a rising trend of homogeneity in their model structures, which brings the opportunity to implement different pre-training models within a uniform framework. In this paper, we present TencentPretrain, a toolkit supporting pre-training models of different modalities. The core feature of TencentPretrain is the modular design. The toolkit uniformly divides pre-training models into 5 components: embedding, encoder, target embedding, decoder, and target. As almost all of common modules are provided in each component, users can choose the desired modules from different components to build a complete pre-training model. The modular design enables users to efficiently reproduce existing pre-training models or build brand-new one. We test the toolkit on text, vision, and audio benchmarks and show that it can match the performance of the original implementations.","authors":["Zhe Zhao","Yudong Li","Cheng Hou","Jing Zhao","Rong Tian","Weijie Liu","Yiren Chen","Ningyuan Sun","Haoyan Liu","Weiquan Mao","Han Guo","Weigang Gou","Taiqiang Wu","Tao Zhu","Wenhang Shi","Chen Chen","Shan Huang","Sihong Chen","Liqun Liu","Feifei Li","Xiaoshuai Chen","Xingwu Sun","Zhanhui Kang","Xiaoyong Du","Linlin Shen","Kimmo Yan"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-2_-speech-and-multimodality-(demo)-(poster)"],"forum":"","id":"D55","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] TencentPretrain: A Scalable and Flexible Toolkit for Pre-training Models of Different Modalities","tldr":"Recently, the success of pre-training in text domain has been fully extended to vision, audio, and cross-modal scenarios. The proposed pre-training models of different modalities are showing a rising trend of homogeneity in their model structures, which brings the opportunity to implement different ...","track":"Speech and Multimodality (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Neuron analysis provides insights into how knowledge is structured in representations and discovers the role of neurons in the network. In addition to developing an understanding of our models, neuron analysis enables various applications such as debiasing, domain adaptation and architectural search. We present NeuroX, a comprehensive open-source toolkit to conduct neuron analysis of natural language processing models. It implements various interpretation methods under a unified API, and provides a framework for data processing and evaluation, thus making it easier for researchers and practitioners to perform neuron analysis. The Python toolkit is available at https://www.github.com/fdalvi/NeuroX.\n\nDemo Video available at: https://youtu.be/mLhs2YMx4u8","authors":["Fahim Dalvi","Hassan Sajjad","Nadir Durrani"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-5_-interpretability-and-analysis-of-models-for-nlp-(demo)-(poster)"],"forum":"","id":"D56","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] NeuroX Library for Neuron Analysis of Deep NLP Models","tldr":"Neuron analysis provides insights into how knowledge is structured in representations and discovers the role of neurons in the network. In addition to developing an understanding of our models, neuron analysis enables various applications such as debiasing, domain adaptation and architectural search...","track":"Interpretability and Analysis of Models for NLP (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Scientific writing involves retrieving, summarizing, and citing relevant papers, which can be time-consuming processes. Although in many workflows these processes are serially linked, there are opportunities for natural language processing (NLP) to provide end-to-end assistive tools. We propose SciLit, a pipeline that automatically recommends relevant papers, extracts highlights, and suggests a reference sentence as a citation of a paper, taking into consideration the user-provided context and keywords. SciLit efficiently recommends papers from large databases of hundreds of millions of papers using a two-stage pre-fetching and re-ranking literature search system that flexibly deals with addition and removal of a paper database. We provide a convenient user interface that displays the recommended papers as extractive summaries and that offers abstractively-generated citing sentences which are aligned with the provided context and which mention the chosen keyword(s). Our assistive tool for literature discovery and scientific writing is available at https://scilit.vercel.app","authors":["Nianlong Gu","Richard H.R. Hahnloser"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-1_-generation-(demo)-(poster)"],"forum":"","id":"D63","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] SciLit: A Platform for Joint Scientific Literature Discovery, Summarization and Citation Generation","tldr":"Scientific writing involves retrieving, summarizing, and citing relevant papers, which can be time-consuming processes. Although in many workflows these processes are serially linked, there are opportunities for natural language processing (NLP) to provide end-to-end assistive tools. We propose SciL...","track":"Generation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"In this paper, we present ISI-Clear, a state-of-the-art, cross-lingual, zero-shot event extraction system and accompanying user interface for event visualization & search. Using only English training data, ISI-Clear makes global events available on-demand, processing user-supplied text in 100 languages ranging from Afrikaans to Yiddish. We provide multiple event-centric views of extracted events, including both a graphical representation and a document-level summary. We also integrate existing cross-lingual search algorithms with event extraction capabilities to provide cross-lingual event-centric search, allowing English-speaking users to search over events automatically extracted from a corpus of non-English documents, using either English natural language queries (e.g. \"cholera outbreaks in Iran\") or structured queries (e.g. find all events of type Disease-Outbreak with agent \"cholera\" and location \"Iran\").","authors":["Chris Jenkins","Shantanu Agarwal","Joel Barry","Steven Fincke","Elizabeth Boschee"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-4_-multilingualism-and-cross-lingual-nlp-(demo)-(poster)"],"forum":"","id":"D66","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Massively Multi-Lingual Event Understanding: Extraction, Visualization, and Search","tldr":"In this paper, we present ISI-Clear, a state-of-the-art, cross-lingual, zero-shot event extraction system and accompanying user interface for event visualization & search. Using only English training data, ISI-Clear makes global events available on-demand, processing user-supplied text in 100 langua...","track":"Multilingualism and Cross-Lingual NLP (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"In this paper, we present our open-source neural machine translation (NMT) toolkit called \"Yet Another Neural Machine Translation Toolkit\" abbreviated as YANMTT - https://github.com/prajdabre/yanmtt, which is built on top of the HuggingFace Transformers library. YANMTT focuses on transfer learning and enables easy pre-training and fine-tuning of sequence-to-sequence models at scale. It can be used for training parameter-heavy models with minimal parameter sharing and efficient, lightweight models via heavy parameter sharing. Additionally, it supports parameter-efficient fine-tuning (PEFT) through adapters and prompts. Our toolkit also comes with a user interface that can be used to demonstrate these models and visualize various parts of the model. Apart from these core features, our toolkit also provides other advanced functionalities such as but not limited to document/multi-source NMT, simultaneous NMT, mixtures-of-experts, model compression and continual learning.","authors":["Raj Dabre","Diptesh Kanojia","Chinmay Sawant","Eiichiro Sumita"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-3_-machine-translation-(demo)-(poster)"],"forum":"","id":"D69","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] YANMTT: Yet Another Neural Machine Translation Toolkit","tldr":"In this paper, we present our open-source neural machine translation (NMT) toolkit called \"Yet Another Neural Machine Translation Toolkit\" abbreviated as YANMTT - https://github.com/prajdabre/yanmtt, which is built on top of the HuggingFace Transformers library. YANMTT focuses on transfer learning a...","track":"Machine Translation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"NLP models are susceptible to learning spurious biases (i.e., bugs) that work on some datasets but do not properly reflect the underlying task. Explanation-based model debugging aims to resolve spurious biases by showing human users explanations of model behavior, asking users to give feedback on the behavior, then\nusing the feedback to update the model. While existing model debugging methods have shown promise, their prototype-level implementations provide limited practical utility. Thus, we propose XMD: the first open-source, end-to-end framework for explanation-based model debugging. Given task- or instance-level explanations,\nusers can flexibly provide various forms of feedback via an intuitive, web-based UI. After receiving user feedback, XMD automatically updates the model in real time, by regularizing the model so that its explanations\nalign with the user feedback. The new model can then be easily deployed into real-world applications via Hugging Face. Using XMD, we can improve the model's OOD performance on text classification tasks by up to 18%.","authors":["Dong-Ho Lee","Akshen Kadakia","Brihi Joshi","Aaron Chan","Ziyi Liu","Kiran Narahari","Takashi Shibuya","Ryosuke Mitani","Toshiyuki Sekiya","Jay Pujara","Xiang Ren"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-6_-interpretability-and-analysis-of-models-for-nlp-(demo)-(poster)"],"forum":"","id":"D71","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] XMD: An End-to-End Framework for Interactive Explanation-Based Debugging of NLP Models","tldr":"NLP models are susceptible to learning spurious biases (i.e., bugs) that work on some datasets but do not properly reflect the underlying task. Explanation-based model debugging aims to resolve spurious biases by showing human users explanations of model behavior, asking users to give feedback on th...","track":"Interpretability and Analysis of Models for NLP (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"The scale of large pre-trained models (PTMs) poses significant challenges in adapting to downstream tasks due to the high optimization overhead and storage costs associated with full-parameter fine-tuning. To address this, many studies explore parameter-efficient tuning methods, also framed as ``delta tuning'' in Ding et al. (2022), which updates only a small subset of parameters, known as ``delta modules'', while keeping the backbone model's parameters fixed. However, the practicality and flexibility of delta tuning have been limited due to existing implementations that directly modify the code of the backbone PTMs and hard-code specific delta tuning methods for each PTM. In this paper, we present OpenDelta, an open-source library that overcomes these limitations by providing a plug-and-play implementation of various delta tuning methods. Our novel techniques eliminate the need to modify the backbone PTMs' code, making OpenDelta compatible with different, even novel PTMs. OpenDelta is designed to be simple, modular, and extensible, providing a comprehensive platform for researchers and practitioners to adapt large PTMs efficiently.","authors":["Shengding Hu","Ning Ding","Weilin Zhao","Xingtai Lv","Zhen Zhang","Zhiyuan Liu","Maosong Sun"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-1_-large-language-models-(demo)-(poster)"],"forum":"","id":"D74","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] OpenDelta: A Plug-and-play Library for Parameter-efficient Adaptation of Pre-trained Models","tldr":"The scale of large pre-trained models (PTMs) poses significant challenges in adapting to downstream tasks due to the high optimization overhead and storage costs associated with full-parameter fine-tuning. To address this, many studies explore parameter-efficient tuning methods, also framed as ``del...","track":"Large Language Models (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Information extraction systems often produce\nhundreds to thousands of strings on a specific\ntopic. We present a method that facilitates\nbetter consumption of these strings, in an ex-\nploratory setting in which a user wants to both\nget a broad overview of what's available, and a\nchance to dive deeper on some aspects. The sys-\ntem works by grouping similar items together,\nand arranging the remaining items into a hierar-\nchical navigable DAG structure. We apply the\nmethod to medical information extraction.","authors":["Itay Yair","Hillel Taub-Tabib","Yoav Goldberg"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-5_-large-language-models-(demo)-(poster)"],"forum":"","id":"D77","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Hierarchy Builder: Organizing Textual Spans into a Hierarchy to Facilitate Navigation","tldr":"Information extraction systems often produce\nhundreds to thousands of strings on a specific\ntopic. We present a method that facilitates\nbetter consumption of these strings, in an ex-\nploratory setting in which a user wants to both\nget a broad overview of what's available, and a\nchance to dive deeper...","track":"Large Language Models (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Recent years have seen impressive progress in AI-assisted writing, yet the developments in AI-assisted reading are lacking. We propose inline commentary as a natural vehicle for AI-based reading assistance, and present CARE: the first open integrated platform for the study of inline commentary and reading. CARE facilitates data collection for inline commentaries in a commonplace collaborative reading environment, and provides a framework for enhancing reading with NLP-based assistance, such as text classification, generation or question answering. The extensible behavioral logging allows unique insights into the reading and commenting behavior, and flexible configuration makes the platform easy to deploy in new scenarios. To evaluate CARE in action, we apply the platform in a user study dedicated to scholarly peer review. CARE facilitates the data collection and study of inline commentary in NLP, extrinsic evaluation of NLP assistance, and application prototyping. We invite the community to explore and build upon the open source implementation of CARE.\n\nGithub Repository: https://github.com/UKPLab/CARE\nPublic Live Demo: https://care.ukp.informatik.tu-darmstadt.de","authors":["Dennis Zyska","Nils Dycke","Jan Buchmann","Ilia Kuznetsov","Iryna Gurevych"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-3_-nlp-applications-(demo)-(poster)"],"forum":"","id":"D78","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] CARE: Collaborative AI-Assisted Reading Environment","tldr":"Recent years have seen impressive progress in AI-assisted writing, yet the developments in AI-assisted reading are lacking. We propose inline commentary as a natural vehicle for AI-based reading assistance, and present CARE: the first open integrated platform for the study of inline commentary and r...","track":"NLP Applications (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"ROOTS is a 1.6TB multilingual text corpus developed for the training of BLOOM, currently the largest language model explicitly accompanied by commensurate data governance efforts. In continuation of these efforts, we present the ROOTS Search Tool: a search engine over the entire ROOTS corpus offering both fuzzy and exact search capabilities. ROOTS is the largest corpus to date that can be investigated this way. The ROOTS Search Tool is open-sourced and available on Hugging Face Spaces: https://huggingface.co/spaces/bigscience-data/roots-search. We describe our implementation and the possible use cases of our tool.","authors":["Aleksandra Piktus","Christopher Akiki","Paulo Villegas","Hugo Laurençon","Gérard Dupont","Sasha Luccioni","Yacine Jernite","Anna Rogers"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-5_-large-language-models-(demo)-(poster)"],"forum":"","id":"D80","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] The ROOTS Search Tool: Data Transparency for LLMs","tldr":"ROOTS is a 1.6TB multilingual text corpus developed for the training of BLOOM, currently the largest language model explicitly accompanied by commensurate data governance efforts. In continuation of these efforts, we present the ROOTS Search Tool: a search engine over the entire ROOTS corpus offerin...","track":"Large Language Models (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"The OPUS-MT dashboard is a web-based platform that provides a comprehensive overview of open translation models. We focus on a systematic collection of benchmark results with verifiable translation performance and large coverage in terms of languages and domains. We provide results for in-house OPUS-MT and Tatoeba models as well as external models from the Huggingface repository and user-contributed translations. The functionalities of the evaluation tool include summaries of benchmarks for over 2,300 models covering 4,560 language directions and 294 languages, as well as the inspection of predicted translations against their human reference. We focus on centralization, reproducibility and coverage of MT evaluation combined with scalability. The dashboard can be accessed live at https://opus.nlpl.eu/dashboard/.","authors":["Jörg Tiedemann","Ona de Gibert"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-6_-resources-and-evaluation-(demo)-(poster)"],"forum":"","id":"D84","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] The OPUS-MT Dashboard – A Toolkit for a Systematic Evaluation of Open Machine Translation Models","tldr":"The OPUS-MT dashboard is a web-based platform that provides a comprehensive overview of open translation models. We focus on a systematic collection of benchmark results with verifiable translation performance and large coverage in terms of languages and domains. We provide results for in-house OPUS...","track":"Resources and Evaluation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"This work introduces the D-WISE Tool Suite (DWTS), a novel working environment for digital qualitative discourse analysis in the Digital Humanities (DH). The DWTS addresses limitations of current DH tools induced by the ever-increasing amount of heterogeneous, unstructured, and multi-modal data in which the discourses of contemporary societies are encoded. To provide meaningful insights from such data, our system leverages and combines state-of-the-art machine learning technologies from Natural Language Processing and Com-\nputer Vision. Further, the DWTS is conceived and developed by an interdisciplinary team of\ncultural anthropologists and computer scientists to ensure the tool's usability for modern\nDH research. Central features of the DWTS are: a) import of multi-modal data like text, image, audio, and video b) preprocessing pipelines for automatic annotations c) lexical and semantic search of documents d) manual span, bounding box, time-span, and frame annotations e) documentation of the research process.","authors":["Florian Schneider","Tim Fischer","Fynn Petersen-Frey","Isabel Eiser","Gertraud Koch","Chris Biemann"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-2_-speech-and-multimodality-(demo)-(poster)"],"forum":"","id":"D85","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] The D-WISE Tool Suite: Multi-Modal Machine-Learning-Powered Tools Supporting and Enhancing Digital Discourse Analysis","tldr":"This work introduces the D-WISE Tool Suite (DWTS), a novel working environment for digital qualitative discourse analysis in the Digital Humanities (DH). The DWTS addresses limitations of current DH tools induced by the ever-increasing amount of heterogeneous, unstructured, and multi-modal data in w...","track":"Speech and Multimodality (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"There are a growing number of table pre-training methods proposed for reasoning over tabular data (e.g., question answering, fact checking, and faithful text generation). However, most existing methods are benchmarked solely on a limited number of datasets, varying in configuration, which leads to a lack of unified, standardized, fair, and comprehensive comparison between methods. This paper presents OpenRT, the first open-source framework for reasoning over tabular data, to reproduce existing table pre-training models for performance comparison and develop new models quickly. We implemented and compared six table pre-training models on four question answering, one fact checking, and one faithful text generation datasets. Moreover, to enable the community to easily construct new table reasoning datasets, we developed TaRAT, an annotation tool which supports multi-person collaborative annotations for various kinds of table reasoning tasks. The researchers are able to deploy the newly-constructed dataset to OpenRT and compare the performances of different baseline systems.","authors":["Yilun Zhao","Boyu Mi","Zhenting Qi","Linyong Nan","Minghao Guo","Arman Cohan","Dragomir Radev"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-3_-information-extraction-(demo)-(poster)"],"forum":"","id":"D89","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] OpenRT: An Open-source Framework for Reasoning Over Tabular Data","tldr":"There are a growing number of table pre-training methods proposed for reasoning over tabular data (e.g., question answering, fact checking, and faithful text generation). However, most existing methods are benchmarked solely on a limited number of datasets, varying in configuration, which leads to a...","track":"Information Extraction (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Schema induction builds a graph representation explaining how events unfold in a scenario. Existing approaches have been based on information retrieval (IR) and information extraction (IE), often with limited human curation. We demonstrate a human-in-the-loop schema induction system powered by GPT-3. We first describe the different modules of our system, including prompting to generate schematic elements, manual edit of those elements, and conversion of those into a schema graph. By qualitatively comparing our system to previous ones, we show that our system not only transfers to new domains more easily than previous approaches, but also reduces efforts of human curation thanks to our interactive interface.","authors":["Tianyi Zhang","Isaac Tham","Zhaoyi Hou","Jiaxuan Ren","Leon Zhou","Hainiu Xu","Li Zhang","Lara Martin","Rotem Dror","Sha Li","Heng Ji","Martha Palmer","Susan Windisch Brown","Reece Suchocki","Chris Callison-Burch"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-1_-nlp-applications-(demo)-(poster)"],"forum":"","id":"D9","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Human-in-the-loop Schema Induction","tldr":"Schema induction builds a graph representation explaining how events unfold in a scenario. Existing approaches have been based on information retrieval (IR) and information extraction (IE), often with limited human curation. We demonstrate a human-in-the-loop schema induction system powered by GPT-3...","track":"NLP Applications (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"This paper introduces the Unified Interactive Natural Understanding of the Italian Language (UINAUIL), a benchmark of six tasks for Italian Natural Language Understanding. We present a description of the tasks and software library that collects the data from the European Language Grid, harmonizes the data format, and exposes functionalities to facilitates data manipulation and the evaluation of custom models. We also present the results of tests conducted with available Italian and multilingual language models on UINAUIL, providing an updated picture of the current state of the art in Italian NLU.","authors":["Valerio Basile","Livio Bioglio","Alessio Bosca","Cristina Bosco","Viviana Patti"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-5_-resources-and-evaluation-(demo)-(poster)"],"forum":"","id":"D90","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] UINAUIL: A Unified Benchmark for Italian Natural Language Understanding","tldr":"This paper introduces the Unified Interactive Natural Understanding of the Italian Language (UINAUIL), a benchmark of six tasks for Italian Natural Language Understanding. We present a description of the tasks and software library that collects the data from the European Language Grid, harmonizes th...","track":"Resources and Evaluation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"The Zero-Shot Learning (ZSL) task pertains to the identification of entities or relations in texts that were not seen during training. ZSL has emerged as a critical research area due to the scarcity of labeled data in specific domains, and its applications have grown significantly in recent years. With the advent of large pretrained language models, several novel methods have been proposed, resulting in substantial improvements in ZSL performance. There is a growing demand, both in the research community and industry, for a comprehensive ZSL framework that facilitates the development and accessibility of the latest methods and pretrained models.\nIn this study, we propose a novel ZSL framework called Zshot that aims to address the aforementioned challenges. Our primary objective is to provide a platform that allows researchers to compare different state-of-the-art ZSL methods with standard benchmark datasets. Additionally, we have designed our framework to support the industry with readily available APIs for production under the standard SpaCy NLP pipeline. Our API is extendible and evaluable, moreover, we include numerous enhancements such as boosting the accuracy with pipeline ensembling and visualization utilities available as a SpaCy extension.","authors":["Gabriele Picco","Marcos Martinez Galindo","Alberto Purpura","Leopold Fuchs","Vanessa Lopez","Thanh Lam Hoang"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-2_-information-extraction-(demo)-(poster)"],"forum":"","id":"D91","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Zshot: An Open-source Framework for Zero-Shot Named Entity Recognition and Relation Extraction","tldr":"The Zero-Shot Learning (ZSL) task pertains to the identification of entities or relations in texts that were not seen during training. ZSL has emerged as a critical research area due to the scarcity of labeled data in specific domains, and its applications have grown significantly in recent years. W...","track":"Information Extraction (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"In our globalized world, a growing number of situations arise where people are required to communicate in one or several foreign languages. In the case of written communication, users with a good command of a foreign language may find assistance from computer-aided translation (CAT) technologies. These technologies often allow users to access external resources, such as dictionaries, terminologies or bilingual concordancers, thereby interrupting and considerably hindering the writing process. In addition, CAT systems assume that the source sentence is fixed and also restrict the possible changes on the target side. In order to make the writing process smoother, we present BiSync, a bilingual writing assistant that allows users to freely compose text in two languages, while maintaining the two monolingual texts synchronized. We also include additional functionalities, such as the display of alternative prefix translations and paraphrases, which are intended to facilitate the authoring of texts. We detail the model architecture used for synchronization and evaluate the resulting tool, showing that high accuracy can be attained with limited computational resources. The interface and models are publicly available at https://github.com/jmcrego/BiSync and a demonstration video can be watched on YouTube https://youtu.be/_l-ugDHfNgU.","authors":["Josep Crego","Jitao Xu","François Yvon"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-4_-multilingualism-and-cross-lingual-nlp-(demo)-(poster)"],"forum":"","id":"D93","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] BiSync: A Bilingual Editor for Synchronized Monolingual Texts","tldr":"In our globalized world, a growing number of situations arise where people are required to communicate in one or several foreign languages. In the case of written communication, users with a good command of a foreign language may find assistance from computer-aided translation (CAT) technologies. Th...","track":"Multilingualism and Cross-Lingual NLP (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"Riveter provides a complete easy-to-use pipeline for analyzing verb connotations associated with entities in text corpora. We prepopulate the package with connotation frames of sentiment, power, and agency, which have demonstrated usefulness for capturing social phenomena, such as gender bias, in a broad range of corpora. For decades, lexical frameworks have been foundational tools in computational social science, digital humanities, and natural language processing, facilitating multifaceted analysis of text corpora. But working with verb-centric lexica specifically requires natural language processing skills, reducing their accessibility to other researchers. By organizing the language processing pipeline, providing complete lexicon scores and visualizations for all entities in a corpus, and providing functionality for users to target specific research questions, Riveter greatly improves the accessibility of verb lexica and can facilitate a broad range of future research.","authors":["Maria Antoniak","Anjalie Field","Jimin Mun","Melanie Walsh","Lauren Klein","Maarten Sap"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-4_-information-extraction-(demo)-(poster)"],"forum":"","id":"D94","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Riveter: Measuring Power and Social Dynamics Between Entities","tldr":"Riveter provides a complete easy-to-use pipeline for analyzing verb connotations associated with entities in text corpora. We prepopulate the package with connotation frames of sentiment, power, and agency, which have demonstrated usefulness for capturing social phenomena, such as gender bias, in a ...","track":"Information Extraction (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"The goal of whitespace correction is to fix space errors in arbitrary given text. For example, given the text \"whi te space correctio nwithTransf or mers\", produce \"whitespace correction with Transformers\". We compare two Transformer-based models, a character-level encoder-decoder model and a byte-level encoder-only model. We find that the encoder-only model is both faster and achieves higher quality. We provide an easy-to-use tool that is over 900 times faster than the previous best tool, with the same high quality. Our tool repairs text at a rate of over 200 kB/s on GPU, with a sequence-averaged F1-score ranging from 87.5% for hard-to-correct text up to 99% for text without any spaces.","authors":["Hannah Bast","Matthias Hertel","Sebastian Walter"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-1_-generation-(demo)-(poster)"],"forum":"","id":"D95","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] Fast Whitespace Correction with Encoder-Only Transformers","tldr":"The goal of whitespace correction is to fix space errors in arbitrary given text. For example, given the text \"whi te space correctio nwithTransf or mers\", produce \"whitespace correction with Transformers\". We compare two Transformer-based models, a character-level encoder-decoder model and a byte-l...","track":"Generation (demo)","underline_id":null,"underline_url":null,"video_url":null},{"abstract":"ESPnet-ST-v2 is a revamp of the open-source ESPnet-ST toolkit necessitated by the broadening interests of the spoken language translation community. ESPnet-ST-v2 supports 1) offline speech-to-text translation (ST), 2) simultaneous speech-to-text translation (SST), and 3) offline speech-to-speech translation (S2ST) -- each task is supported with a wide variety of approaches, differentiating ESPnet-ST-v2 from other open source spoken language translation toolkits. This toolkit offers state-of-the-art architectures such as transducers, hybrid CTC/attention, multi-decoders with searchable intermediates, time-synchronous blockwise CTC/attention, Translatotron models, and direct discrete unit models. In this paper, we describe the overall design, example models for each task, and performance benchmarking behind ESPnet-ST-v2, which is publicly available at https://github.com/espnet/espnet.","authors":["Brian Yan","Jiatong Shi","Yun Tang","Hirofumi Inaguma","Yifan Peng","Siddharth Dalmia","Peter Polak","Patrick Fernandes","Dan Berrebbi","Tomoki Hayashi","Xiaohui Zhang","Zhaoheng Ni","Moto Hira","Soumi Maiti","Juan Pino","Shinji Watanabe"],"card_image_path":"","category":"Demo","demo_url":null,"event_ids":["session-1_-speech-and-multimodality-(demo)-(poster)"],"forum":"","id":"D96","is_paper":true,"keywords":[],"material":null,"paper_pdf":null,"paper_type":"nan","poster_pdf":null,"preview_image":null,"program":"Demo","similar_paper_ids":[],"slides_pdf":null,"title":"[Demo] ESPnet-ST-v2: Multipurpose Spoken Language Translation Toolkit","tldr":"ESPnet-ST-v2 is a revamp of the open-source ESPnet-ST toolkit necessitated by the broadening interests of the spoken language translation community. ESPnet-ST-v2 supports 1) offline speech-to-text translation (ST), 2) simultaneous speech-to-text translation (SST), and 3) offline speech-to-speech tra...","track":"Speech and Multimodality (demo)","underline_id":null,"underline_url":null,"video_url":null}]
